cases/subsonic/Zhang/We3500/b_Dinj/setup/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// U_inf = 163.1 m/s (Zhang Sim3, We3500, TL=70%) in direzione crossflow (X)

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (163.1 0 0);

boundaryField
{
    gasInlet
    {
        type            fixedValue;
        value           uniform (163.1 0 0);
    }

    outletRight
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);    // backflow a vel nulla
        value           uniform (163.1 0 0);
    }

    outletTop
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);    // backflow a vel nulla
        value           uniform (163.1 0 0);
    }

    bottomWall
    {
        type            noSlip;
    }

    filmTopWall
    {
        type            noSlip;
    }

    stepWall
    {
        type            noSlip;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
