cases/subsonic/Zhang/We3500/b_Dinj/setup/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Frazione massica N2 = 1 (gas carrier puro)

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    gasInlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outletRight
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    outletTop
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    filmTopWall
    {
        type            zeroGradient;
    }

    stepWall
    {
        type            zeroGradient;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
