cases/subsonic/Zhang/We3500/b_Dinj/setup/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Diffusività termica turbolenta [kg/(m s)]
// Calcolata dal solver (campo derived), inizialmente zero

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    gasInlet
    {
        type            calculated;
        value           uniform 0;
    }

    outletRight
    {
        type            calculated;
        value           uniform 0;
    }

    outletTop
    {
        type            calculated;
        value           uniform 0;
    }

    bottomWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    filmTopWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    stepWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
